[
  {
    "url": "photos/photo1.jpg",
    "description": "This is me during my School practice held at Kuoyo Kochia Boys High School. The assignment Took Place from April 2025- August 2025."
  },
  {
    "url": "photos/photo2.jpg",
    "description": "A breathtaking mountain view."
  },
  {
    "url": "photos/photo3.jpg",
    "description": "City skyline glowing at night."
  },
  {
    "url": "photos/photo4.jpg",
    "description": "Just a random Selfie"
  },
  {
    "url": "photos/IMG_20250329_095112_550.jpg",
    "description": "Me Chilling In my room, At campus, decided to take a snap"
  },
  {
    "url": "photos/photo5.png",
    "description": "During my School Practice, I decided to take a pic near the admin block, just for memories"
  },
  {
    "url": "photos/castro Profile.png",
    "description": "This is Castro Odhiambo, Very fresh, October 2022, when I just joined Masinde Muliro University of Science and Technology. One month old in campus, took this photo as a memory in Hall  2 male hostels. In most of my Social Media Platforms I use this Photo as the Profile picture."
  },
  {
    "url": "photos/20250301_123833.jpg",
    "description": "Me at Home, in Homabay County, During a short break I took from Campus, this was around 30th February, 2025.  A special friend to me was sick during this time. I can Say Was So stressed, I was missing her so much since she was admitted, but home, we work to make ends meet, I took this photo while making some firewood for sale."
  },
  {
    "url": "photos/043acf47221b7dac20f2ef1caf9e8c43.png",
    "description": "Me with my friend Machokins Odiwuor. Machokins was my classmate, here, We are at Samanga Lutheran mixed secondary school, in 2023 second term. we were teaching during the long holiday Break. We are standing in front of the school library."
  },
  {
    "url": "photos/0c2de4c5-a2a9-4f20-b4cc-3617b376cf65.jpeg",
    "description": "Castro, 2024 at Samanga Lutheran Secondary School, Pausing for this Pic with My fellow 'Gen-z' teachers . Here i was Teaching at Samanga Sec School For the Second time"
  },
  {
    "url": "photos/95ca21daafc89c93568a5f0802a09ef5.png",
    "description": "2024, one of the fine Saturdays, on my way to school, Samanga, for Saturday Lessons. just few meters from home, i took this selfie."
  },
  {
    "url": "photos/2b8c368f01a53922ed669ed53abaf25c.png",
    "description": "With My friend Kennedy. At the Campus Ecosystem, behind the MMUST library. we just reported to campus for the second semester of year 1."
  },
  {
    "url": "photos/IMG_20250329_095112_550.jpg",
    "description": "This photo, Is one if the best photos I took while in Campus, haha, maybe I had just Fallen In love, you never know. Doing My Third Year At MMUST."
  }
]
